src/main/resources/templates/getStudentSoapEnvelope.ftl

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:gs="lwenstrom.net/ws/students" xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getStudentRequest>
            <gs:studentID>34937</gs:studentID>
        </gs:getStudentRequest>
    </soapenv:Body>
</soapenv:Envelope>
